app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "gina@gmail.com"], ["LIMIT", 1]]
---
  def create
    u = User.find_by(email: params[:email])