app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "hi@email.com"], ["password_digest", "$2a$10$pAEV5McxSdqKuSIyNS1pYu1EmTemRZeeoq6PuhIcCd8NLuCB94uOa"], ["created_at", 2017-08-06 21:41:29 UTC], ["updated_at", 2017-08-06 21:41:29 UTC]]
---
  def create
    @user = User.new
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]

    if @user.save